{
  "basic_title": "Web Developer",
  "basic_biography": "On the net, they live under the name of JIYUUJIN. Birthday is November 04, 1988. Born in Toyonaka City, Osaka Prefecture. Gender is male. Currently, we are active mainly in the Kansai area (Kyoto and Osaka).",
  "label": "Label",
  "labels": {
    "basic_info": "Basic Information",
    "business_card": "Online Business Card",
    "curriculum_vitae": "Curriculum Vitae",
    "position": "Position",
    "contribute": "Contribute",
    "payment_test": "Pay (TEST)",
    "payment": "Pay",
    "related_links": "Related Links",
    "youtube_live": "YouTube Live"
  },
  "confirm_policy": "Confirm Policy",
  "enter_payment_method": "Enter Payment Method",
  "work": "Work",
  "work_experience": "I started my career as an iOS native app engineer. While acquiring basic coding through work as an application engineer, I also worked on improving the UX of the management screen (PHP) that runs behind it. I was fascinated by the part that went through the process of improving the Web, and gradually stepped into the area of ​​front-end engineers, such as Node.js and other front-ends, CSS design, and the use of frameworks.",
  "about_me": "About Me",
  "skill": "Skill",
  "skill_set": "Skill Set",
  "skill_set_coming_soon": "Skill Set (Coming Soon)",
  "product": "Product",
  "sub_product": "Sub Product",
  "product_technology_used": "Technology Used",
  "repository_managed": "Repositories",
  "product_url": "URL",
  "products": {
    "design_system": "nekohack Design System",
    "react_design_system": "Vue.js Design System",
    "vue_design_system": "React Design System",
    "payment_design_system": "Stripe Payment Design System",
    "profile": "Web Developer - Yuma Kitamura",
    "profile_description_1": "Production started in Feb 2020, published in Mar 2020. This profile website was opened in March 2020 to separate it from the technical blog and introduce itself. The position of the Web cat blog, which has been held by the stage / LT as an entrance to introduce oneself, will be changed for this profile website.",
    "profile_description_2": "I used to use webpack as one of the build tools at work, which is also why I started using Parcel. I created a simple profile website. However, I now consider this repository as `archived`, considering that it was deployed to the production environment without any consideration of operational aspects.",
    "profile_description_3": "As a result, I was able to share my experience of producing a profile website for the first time at the \"Kyoto dev kafu. After my first time speaking at the event, I was made aware that I should emphasize the style of transmitting know-how rather than introducing myself as an engineer, and this led me to create a technical blog, \"Tech Blog.",
    "tech_hub": "A portal website created to incorporate the feelings of a sole proprietor while keeping in mind all activities such as side businesses, regardless of the main business. Our community (i-Company), including the portal website, aims to contribute widely to solving problems on the Web. At the moment, I have put together multiple media such as my blog and note in one feed.",
    "tech_blog": "Tech Blog",
    "tech_blog_description_1": "This is a personal blog that I opened in October 2018 to share my knowledge. The name comes from my love of cats, which is one of my characteristics, as well as from the fact that as a personal web developer, I am skilled in front-end development, and am also very interested in infrastructure. At the time, Contentful, one of the headless CMSs, was in full swing. At the time, Contentful, one of the Headless CMSs, was in its infancy, and I couldn't find a lasting product in the middle of my work, so it became urgent for me to have my own personal product without any external influence, and I started working on Nuxt (v1.0.0-rc.11 at the time)",
    "tech_blog_description_2": "This blog is a product written in JavaScript at the time of its creation and later rewritten in TypeScript. As a means of writing in TypeScript, we adopted the Decorator API among many other APIs, but later changed it to write the Options API (using `Vue.extend`).",
    "tech_blog_description_3": "Then, after a two-year \"COVID19 Disaster,\" we switched to Composition API to support Nuxt 3 (Vue 3). Currently, the newly released Nuxt 3 blog and the previously released Nuxt 2 blog are being operated in parallel.",
    "minna_de_blog": "Blog made by everyone",
    "minna_de_blog_description": "Every weekday morning, we started \"Ohayo Engineer\" as a place to chat loosely on Twitter Spaces. We also create and operate a website so that you can look back on the content of the chat in any time.",
    "flutterkaigi_2021": "FlutterKaigi 2021 official website",
    "flutterkaigi_2021_description": "When holding FlutterKaigi 2021, the first tech conference on the theme of Flutter in Japan, I was mainly in charge of producing the official website.",
    "vscodeconjp_2021": "VSCode Conference Japan 2021 official website",
    "vscodeconjp_2021_description": "This year, the 10th anniversary of VS Code, will be held under the concept of Happy Extension. Also, unlike the previous VSCode Conference, I was in charge of VSCode Conference Japan 2021 teaser website production in response to the increased momentum for producing the official website for the first time.",
    "insight": "A website established to calculate the performance of each website that it operates as a quantitative numerical value on a daily basis. The numbers here are based on PageSpeed ​​Insights v5 and are regularly observed daily using Google Cloud Run."
  },
  "timeline": "Timeline",
  "timeline_description": "I usually write my own timeline on a basis of projects, and act without being trapped in an organization . I have created it including turning so far, and tried to put together non-technical elements into the timeline as much as possible.",
  "created_the_ohayo_website": "Created the ohayo website",
  "created_the_ohayo_website_in_memo": "Created to look back on the content of the fluffy chat in any time.",
  "worked_vcube_eventin": "Worked V-cube EventIn",
  "created_vscodecon_jp_2021_website": "Created VS Code Conference JP 2021 website",
  "created_vscodecon_jp_2021_website_in_memo": "The first time in the history of VS Code Meetup that I worked on the official website.",
  "start_ohayo_engineer_on_twitter_spaces": "Start \"ohayo engineer\" on Twitter Spaces",
  "start_ohayo_engineer_on_twitter_spaces_in_memo": "I started \"Ohayo Engineer\", a place for developers to talk every weekday morning as a place for loose chats.",
  "created_flutterkaigi_2021_website": "Created FlutterKaigi 2021 website",
  "created_flutterkaigi_2021_website_in_memo": "Organized Japan's first technical conference with Flutter as the main theme.",
  "finish_the_dormant_period": "Declared the end of the 1-year dormancy period",
  "finish_the_dormant_period_in_memo": "After receiving various invitations, I made it clear that I would be closing the curtain on my dormant period to break the patience I had been holding for the past year.",
  "start_the_dormant_period": "Decided to go into a dormant period of speaking, writing, and community management",
  "start_the_dormant_period_in_memo": "Considering the COVID19 situation, I decided to go into a period of dormancy in a wide range of ways, including speaking, writing, and community management.",
  "created_a_profile_website": "Created a profile website",
  "created_a_profile_website_in_memo": "A profile website was opened to separate it from the technical blog and introduce itself.",
  "worked_smaregi_app_market": "Worked Smaregi App Market",
  "worked_smaregi_app_market_in_memo": "In preparation for the release of Smaregi 4, I have developed the new Application Market. Worked on the functional development of the accompanying UI components.",
  "participated_in_js_conf_jp_2019": "Participated in JS Conf JP",
  "participated_in_fec_fukuoka_2019": "Participated in Frontend Conference Fukuoka",
  "participated_in_fec_fukuoka_2019_in_memo": "I participated as one of the supporters for my acquaintance and traveled to Fukuoka.",
  "participated_in_front_kansai_2019": "Participated in Frontend Conference Kansai",
  "participated_in_front_kansai_2019_in_memo": "For the first time, I participated in a technical conference as one of the staff.",
  "started_to_consider_dev_rel": "Recognized DevRel as corporate PR",
  "started_to_consider_dev_rel_in_memo": "For the first time, I held the company (Smaregi) sponsored meetup for developers. This was the first time we held a meetup hosted by the company (Smaregi) for developers, and from the perspective of HR (Human Resource), we actively supported community management and recruitment.",
  "improved_smaregi_pos": "Improved Smaregi POS",
  "improved_smaregi_pos_in_memo": "Mainly UX improvement, created an elaborate UI. Among the existing functions, the UI that needs improvement from the user's perspective has been recreated to improve the user experience (UX).",
  "worked_roxx_agent_bank": "Worked Agent Bank (formerly SARDINE)",
  "worked_roxx_agent_bank_in_memo": "I participated in repositories that plugins based design and development, with speed. I also had the opportunity to learn a part of Scrum.",
  "participated_in_vue_fes_japan_2018": "Participated in Vue Fes Japan",
  "created_a_technical_blog": "Created a technical blog",
  "created_a_technical_blog_in_memo": "A personal blog opened to disseminate knowledge.",
  "participated_in_unite_tokyo_2017": "Participated in Unite Tokyo",
  "participated_in_unite_tokyo_2017_in_memo": "I personally participated in the first tech conference.",
  "worked_ponos_namesta": "Worked Namesta",
  "improved_ponos_battlecats": "Improved Battlecats",
  "worked_the_remote_viewing_app": "Worked the remote viewing app",
  "started_github": "Started to use Github",
  "worked_the_remote_viewing_app_in_memo": "Based on contract development.",
  "community": "Tech Community",
  "community_role": "Participating in the following community as a staff member",
  "slide": "Stage Slide",
  "slides": {
    "about_22s_googleio_wwdc_recap": "About Google I/O 2022 Recap × WWDC 2022 Recap",
    "react_workshop_in_line_developer_community_2022": "React (Vite) × LIFF workshop 2022",
    "inside_the_website_in_vscodecon_jp_2021": "Inside the website in VSCodeCon JP 2021",
    "github_issues_usage_as_a_cmd": "Use Github issues as a CMS",
    "recommend_to_developers_relations_in_community_handson": "Recommend To DevRel in community handson",
    "personal_sponsor_in_jaws_days_2021": "One of personal sponsors in JAWS DAYS 2021",
    "the_world_revolves_around_slack": "The world revolves around Slack",
    "pwa_that_was_closer_to_me": "PWA, that was closer to me",
    "practical_use_of_transition": "Practical use of Transition",
    "the_point_of_composition_api": "The point of Composition API",
    "looking_back_in_2019": "Looking back in 2019",
    "vue_cli_test_tips": "Vue CLI test tips"
  },
  "portrait": "Portrait",
  "portrait_description": "I often wear event T-shirts at offline events such as conferences. Until now, I had been at Vue Fes, JSConf, and Front-End conferences. Basically my appearance is NG in online, but please feel free to contact us.",
  "contact": "Contact",
  "covid19": {
    "fully_vaccinated": "Fully Vaccinated"
  }
}
