{
  "basic_title": "Web Developer",
  "basic_biography": "On the net, they live under the name of JIYUUJIN. Birthday is November 04, 1988. Born in Toyonaka City, Osaka Prefecture. Gender is male. Currently, we are active mainly in the Kansai area (Kyoto and Osaka).",
  "label": "Label",
  "labels": {
    "basic_info": "Basic Information",
    "business_card": "Online Business Card",
    "curriculum_vitae": "Curriculum Vitae",
    "position": "Position",
    "contribute": "Contribute",
    "payment_test": "Pay (TEST)",
    "payment": "Pay",
    "related_links": "Related Links",
    "youtube_live": "YouTube Live"
  },
  "confirm_policy": "Confirm Policy",
  "enter_payment_method": "Enter Payment Method",
  "work": "Work",
  "work_experience": "I started my career as a developer in iOS native applications. While acquiring basic coding skills through my work as an application developer, I also worked on improving the UX of the administration website (PHP) that runs behind the applications. I was attracted to this part of the web improvement process, and gradually entered the realm of front-end engineering, including Node.js, CSS design, and the use of JavaScript frameworks. And now, while considering the optimal solution for the overall design of applications including the Cloud (Azure/AWS), I am practicing daily to improve their quality and add aggressive features.",
  "about_me": "About Me",
  "skill": "Skill",
  "skill_set": "Skill Set",
  "skill_set_coming_soon": "Skill Set (Coming Soon)",
  "product": "Product",
  "sub_product": "Sub Product",
  "product_technology_used": "Technology Used",
  "repository_managed": "Repositories",
  "media": "Weblog Media",
  "product_url": "URL",
  "products": {
    "design_system": "nekohack Design System",
    "react_design_system": "Vue.js Design System",
    "vue_design_system": "React Design System",
    "payment_design_system": "Stripe Payment Design System",
    "profile": "Web Developer - Yuma Kitamura",
    "profile_description": "The purpose of this profile site, which was launched in March 2020, was to create an opportunity to introduce myself, while keeping it separate from my technical blog. The personal blog was changed when we launched this profile site, as the \"Kyoto dev kafu\" was a platform for us to introduce ourselves. After adopting Parcel and Gatsby.js, a JavaScript framework for SG, I am currently using Next.js under the mono-reporting environment.",
    "tech_hub": "A portal website created to incorporate the feelings of a sole proprietor while keeping in mind all activities such as side businesses, regardless of the main business. Our community (i-Company), including the portal website, aims to contribute widely to solving problems on the Web. At the moment, I have put together multiple media such as my blog and note in one feed.",
    "tech_blog": "Tech Blog",
    "tech_blog_description": "A personal blog has been published in October 2018 to disseminate knowledge. The name comes from my love of cats, which is a characteristic of myself, and as a Web Developer, I am operating this blog with the goal of having a product mindset. At the time, Contentful, one of the headless CMS, was running, and I was unable to find a lasting product for my work, so I had an urgent need to have a personal product that would not be affected by any external influences. I started to work with Nuxt (`v1.0.0-rc.11` at that time) as a base. After rewriting to TypeScript and adopting the Decorator API, we switched to the Composition API in order to support Nuxt 3. Currently, we are operating in an unprecedented way, changing the technology stack from Nuxt to Deno.",
    "vuefes_2022": "Vue Fes Japan Online 2022",
    "vuefes_2022_description": "Vue Fes Japan Online 2022 is the largest conference related to Vue.js in Japan organized by the Vue.js community. This year again, there will be many sessions where experts in various fields will generously share their knowledge of technologies related to Vue.js, case studies, and findings. We are pleased to announce that we are leading the technical aspects of Vue Fes Japan Online 2022, including the initial launch of the website.",
    "revup_2022": "LINE Developers Community | REV UP 2022",
    "revup_2022_description": "LINE Developers Community REV UP 2022 is the largest conference related to LINE in Japan organized by the LINE developers community. This year again, there will be many sessions where experts in various fields will generously share their knowledge and experiences of technologies related to LINE, case studies, and findings. I has created the website for REV UP 2022.",
    "flutterkaigi_2022": "FlutterKaigi 2022 official website",
    "flutterkaigi_2022_description": "We were responsible for the initial launch of the FlutterKaigi website and for leading the entire project. We were also responsible for new initiatives such as posting sponsors and timetable of sessions on the website.",
    "flutterkaigi_2021": "FlutterKaigi 2021 official website",
    "flutterkaigi_2021_description": "We are pleased to announce that we are leading the technical aspects of FlutterKaigi, including the initial launch of the website, for FlutterKaigi, a tech conference themed Flutter in Japan.",
    "vscodeconjp_2023": "VS Code Conference JP 2022-2023 official website",
    "vscodeconjp_2023_description": "This year's event was held under the format of the pre-event at the end of the year 2022 and the main event at the beginning of the year. In addition, we built the VS Code Conference Japan 2022-2023 teaser website in response to the growing momentum to manage monorepo along with last year's website.",
    "vscodeconjp_2021": "VS Code Conference JP 2021 official website",
    "vscodeconjp_2021_description": "This year, the 10th anniversary of VS Code, will be held under the concept of Happy Extension. Also, unlike the previous VS Code Conference, I was in charge of VS Code Conference Japan 2021 teaser website production in response to the increased momentum for producing the official website for the first time.",
    "insight": "A website established to calculate the performance of each website that it operates as a quantitative numerical value on a daily basis. The numbers here are based on PageSpeed ​​Insights v5 and are regularly observed daily using Google Cloud Run."
  },
  "job_timeline": "Job Timeline",
  "job_timeline_description": "The timeline was created on basis of projects and my own affiliation. The timeline is a rough overview of my personality, with two aspects: my main job and other.",
  "timeline": "Timeline",
  "timeline_description": "I usually write my own timeline on a basis of projects, and act without being trapped in an organization . I have created it including turning so far, and tried to put together non-technical elements into the timeline as much as possible.",
  "community": "Tech Community",
  "community_role": "Participating in the following community as a staff member",
  "slide": "Stage Slide / Writing",
  "portrait": "Portrait",
  "portrait_description": "I often wear event T-shirts at offline events such as conferences. Until now, I had been at Vue Fes, JSConf, and Front-End conferences. Basically my appearance is NG in online, but please feel free to contact us.",
  "contact": "Contact",
  "covid19": {
    "fully_vaccinated": "Fully Vaccinated"
  }
}
