{
  "basic_title": "Web Developer",
  "basic_biography": "I go by the name \"Jiyuujin\" (自由人) online. My birthday is November 4, 1988, and I was born in Toyonaka City, Osaka Prefecture. My gender is male. I serve as a board member (Vice President) of the general incorporated FlutterKaigi association, a board member (President) of the general incorporated Kwansei Kaihatusha Kaigi Association. Currently, I am active mainly in the Kansai region (Kyoto and Osaka). This website was launched in March 2020, with the purpose of creating an opportunity to introduce myself, while keeping it separate from my personal blog.\nMy journey into the world of study groups started on September 14, 2018, with the \"Kyoto Dev Café\" event hosted by Furyu Corporation. Since then, I have shifted towards a policy of valuing connections outside of my company.",
  "label": "Label",
  "labels": {
    "basic_info": "Basic Information",
    "business_card": "Online Business Card",
    "curriculum_vitae": "Curriculum Vitae",
    "position": "Position",
    "contribute": "Contribute",
    "payment_test": "Pay (TEST)",
    "payment": "Pay",
    "related_links": "Related Links",
    "youtube_live": "YouTube Live"
  },
  "confirm_policy": "Confirm Policy",
  "enter_payment_method": "Enter Payment Method",
  "work": "Work",
  "work_experience": "My career started as an iOS native app engineer. Through my work as an app engineer, I gained fundamental coding skills while also working on improving the UX of the management website (PHP) that ran behind the scenes. I found the process of improving the web side of things particularly appealing, which led me to gradually explore the front-end engineering field, including technologies like Node.js, CSS design, and JavaScript frameworks.\nCurrently, I focus on optimizing the design of entire applications, including cloud services (Azure / AWS), while working daily to enhance their quality and proactively add new features. Additionally, as a member of the LINE Developers Community's API Expert group, I actively promote LINE's front-end framework and Messaging API. For the REV UP 2022 conference organized by LINE Developers, I was responsible for creating the official website.\nIn the future, I plan to continue sharing knowledge and contributing to communities not only through my personal blog but also through platforms like Zenn.",
  "about_me": "About Me",
  "skill": "Skill",
  "skill_set": "Skill Set",
  "skill_set_coming_soon": "Skill Set (Coming Soon)",
  "product": "Product",
  "sub_product": "Sub Product",
  "product_technology_used": "Technology Used",
  "repository_managed": "Repositories",
  "media": "Weblog Media",
  "product_url": "URL",
  "products": {
    "tech_blog": "Personal Blog (formerly: Web Neko Blog)",
    "tech_blog_description": "This is a personal blog that was created and launched in October 2018 using Nuxt (v1.0.0-rc.11) to share my knowledge. The name was chosen based on my love for cats, which is a characteristic of mine, and it is operated with the goal of fostering a product-oriented mindset as a web developer. At the time, one of the popular Headless CMS platforms, Contentful, was gaining attention, and there was a growing need to have a personal product outside of work to seek new challenges and stimulation. During the course of its operation, I rewrote the blog in TypeScript, adopted the Decorator API, and eventually switched to the Composition API to support Nuxt 3. Currently, I have transitioned to Lume, a static site generator running on Deno, which offers easy configuration and flexibility for customization.",
    "staff_operations": "Staff Operations",
    "staff_operations_description": "At FlutterKaigi, I have been a core staff member for four consecutive years since 2021, during the COVID-19 pandemic. Similarly, at Vue Fes Japan, I have been a core staff member for three consecutive years since 2022, supporting the conference staff operations. My participation in both events was driven by the desire to challenge myself with Vue.js-related technologies beyond my main job and to engage in communication with various experts. Among these experiences, I have been responsible for leading the launch of the name card for Vue Fes Japan 2023-24, including the selection of technologies like Supabase, and actively leading the team.",
    "insight": "A website established to calculate the performance of each website that it operates as a quantitative numerical value on a daily basis. The numbers here are based on PageSpeed ​​Insights v5 and are regularly observed daily using Google Cloud Run."
  },
  "job_timeline": "Job Timeline",
  "job_timeline_description": "The timeline was created on basis of projects and my own affiliation. The timeline is a rough overview of my personality, with two aspects: my main job and other.",
  "timeline": "Timeline",
  "timeline_description": "I usually write my own timeline on a basis of projects, and act without being trapped in an organization . I have created it including turning so far, and tried to put together non-technical elements into the timeline as much as possible.",
  "community": "Tech Community",
  "community_role": "Participating in the following community as a staff member",
  "slide": "Stage Slide / Writing",
  "portrait": "Portrait",
  "portrait_description": "At offline events like tech conferences, I often wear event T-shirts. Since attending Vue Fes Japan 2018, I have also participated in JS Conf JP, Frontend Conference (Kansai/Fukuoka), and others. Due to my deep interest in photography, I’m not particularly accustomed to being photographed, and as a general rule, I prefer not to have my appearance shared on social media or other platforms. However, this is not always the case, so please feel free to reach out if you have any questions.",
  "contact": "Contact",
  "privacy_policy": "Privacy Policy",
  "covid19": {
    "fully_vaccinated": "Fully Vaccinated"
  }
}
